[
  {
    "word": "آ",
    "definition": "آ: الأَلف: تأْليفها مِنْ هَمْزَةٍ وَلَامٍ وَفَاءٍ، وَسُمِّيَتْ أَلفاً لأَنها تأْلف الْحُرُوفَ كُلَّهَا، وَهِيَ أَكثر الْحُرُوفِ دُخُولًا فِي الْمَنْطِقِ، وَيَقُولُونَ: هَذِهِ أَلِفٌ مُؤلَّفةٌ. وَقَدْ جَاءَ عَنْ بَعْضِهِمْ فِي قَوْلِهِ تَعَالَى: أَلَمْ*، أَنَّ الأَلف اسْمٌ مِنْ أَسماء اللَّهِ تَعَالَى وَتَقَدَّسَ، وَاللَّهُ أَعلم بِمَا أَراد، والأَلف اللَّيِّنَةُ لَا صَرْفَ لَهَا إِنَّمَا هِيَ جَرْسُ مَدَّةٍ بَعْدِ فَتْحَةٍ، وَرَوَى الأَزهري عَنْ أَبي الْعَبَّاسِ أَحمد بْنِ يَحْيَى وَمُحَمَّدِ بْنِ يَزِيدَ أَنهما قَالَا: أُصول الأَلفات ثَلَاثَةٌ وَيَتْبَعُهَا الْبَاقِيَاتُ: أَلف أَصلية وَهِيَ فِي الثُّلَاثِيِّ مِنَ الأَسماء، وأَلف قَطْعِيَّةٌ وَهِيَ فِي الرُّبَاعِيِّ، وأَلِفٌ وَصْلِيَّةٌ وَهِيَ فِيمَا جَاوَزَ الرُّبَاعِيَّ، قَالَا: فالأَصلية مِثْلُ أَلِفِ أَلِفٍ وإلْفٍ وأَلْفٍ وَمَا أَشبهه، وَالْقَطْعِيَّةُ مِثْلُ أَلف أَحمد وأَحمر وَمَا أَشبهه، وَالْوَصْلِيَّةُ مِثْلُ أَلف اسْتِنْبَاطٍ وَاسْتِخْرَاجٍ، وَهِيَ فِي الأَفعال إِذَا كَانَتْ أَصلية مِثْلَ أَلف أَكَل، وَفِي الرُّبَاعِيِّ إِذَا كَانَتْ قَطْعِيَّةً مِثْلَ أَلف أَحْسَن، وَفِيمَا زَادَ عَلَيْهِ مِثْلَ أَلف اسْتَكْبَرَ وَاسْتَدْرَجَ إِذَا كَانَتْ وَصْلِيَّةً، قَالَا: وَمَعْنَى أَلف الِاسْتِفْهَامِ ثَلَاثَةٌ: تَكُونُ بَيْنَ الْآدَمِيِّينَ يَقُولُهَا بَعْضُهُمْ لِبَعْضٍ اسْتِفْهَامًا، وَتَكُونُ مِنَ الجَبّار لِوَلِيِّهِ تَقْرِيرًا وَلِعَدُوِّهِ تَوْبِيخًا، فَالتَّقْرِيرُ كَقَوْلِهِ عَزَّ وَجَلَّ لِلْمَسِيحِ: أَأَنْتَ قُلْتَ لِلنَّاسِ؛ قَالَ أَحمد بْنُ يَحْيَى: وَإِنَّمَا وَقَعَ التَّقْرِيرُ لِعِيسَى، عَلَيْهِ السَّلَامُ، لأَن خُصُومه كَانُوا حُضوراً فأَراد اللَّهُ عَزَّ وَجَلَّ مِنْ عِيسَى أَنْ يُكَذِّبهم بِمَا ادَّعَوْا عَلَيْهِ، وأَما التَّوْبِيخُ لِعَدُوِّهِ فَكَقَوْلِهِ عَزَّ وَجَلَّ: أَصْطَفَى الْبَناتِ عَلَى الْبَنِينَ، وَقَوْلِهِ: أَأَنْتُمْ أَعْلَمُ أَمِ اللَّهُ، أَأَنْتُمْ أَنْشَأْتُمْ شَجَرَتَها؛ وَقَالَ أَبو مَنْصُورٍ: فَهَذِهِ أُصول الأَلفات. وَلِلنَّحْوِيِّينَ أَلقابٌ لأَلفات غَيْرِهَا تُعْرَفُ بِهَا، فَمِنْهَا الأَلف الْفَاصِلَةُ وَهِيَ فِي مَوْضِعَيْنِ: أَحدهما الأَلف الَّتِي تُثْبِتُهَا الْكَتَبَةُ بَعْدَ وَاوِ الْجَمْعِ لِيُفْصَلَ بِهَا بَيْنَ وَاوِ الْجَمْعِ وَبَيْنَ مَا بَعْدَهَا مِثْلَ كَفَرُوا وشَكَرُوا، وَكَذَلِكَ الأَلفُ الَّتِي فِي مِثْلِ يَغْزُوا وَيَدْعُوا، وَإِذَا اسْتُغْنِيَ عَنْهَا لِاتِّصَالِ الْمَكْنِيِّ بِالْفِعْلِ لَمْ تَثْبُتْ هَذِهِ الأَلف الْفَاصِلَةُ، والأُخرى الأَلف الَّتِي فَصَلَتْ بَيْنَ النُّونِ الَّتِي هِيَ عَلَامَةُ الإِناث وَبَيْنَ النُّونِ الثَّقِيلَةِ كَرَاهَةَ اجْتِمَاعِ ثَلَاثِ نُونَاتٍ فِي مِثْلِ قَوْلِكَ لِلنِّسَاءِ فِي الأَمر افْعَلْنانِّ، بِكَسْرِ النُّونِ وَزِيَادَةِ الأَلف بَيْنِ النُّونَيْنِ؛ وَمِنْهَا أَلف العِبارة لأَنها تُعبر عَنِ الْمُتَكَلِّمِ مِثْلَ قَوْلِكَ أَنا أَفْعَلُ كَذَا وأَنا أَستغفر اللَّهَ وَتُسَمَّى الْعَامِلَةَ؛ وَمِنْهَا الأَلف الْمَجْهُولَةُ مِثْلَ أَلف فَاعِلٍ وَفَاعُولٍ وَمَا أَشبهها، وَهِيَ أَلف تَدْخُلُ فِي الأَفعال والأَسماء مِمَّا لَا أَصل لَهَا، إِنَّمَا تأْتي لإِشباع الْفَتْحَةِ فِي الْفِعْلِ وَالِاسْمِ، وَهِيَ إِذَا لَزِمَتْها الحركةُ كَقَوْلِكَ خاتِم وخواتِم صَارَتْ وَاوًا لَمَّا لَزِمَتْهَا الْحَرَكَةُ بِسُكُونِ الأَلف بَعْدَهَا، والأَلف الَّتِي بَعْدَهَا هِيَ أَلف الْجَمْعِ، وَهِيَ مَجْهُولَةٌ أَيضاً؛ وَمِنْهَا أَلف الْعِوَضِ وَهِيَ الْمُبْدَلَةُ مِنَ التَّنْوِينِ الْمَنْصُوبِ إِذَا وَقَفْتَ عَلَيْهَا كَقَوْلِكَ رأَيت زَيْدًا وَفَعَلْتُ خَيْرًا وَمَا أَشبهها؛ وَمِنْهَا أَلف الصِّلة وَهِيَ أَلفٌ تُوصَلُ بِهَا فَتحةُ الْقَافِيَةِ، فَمِثْلُهُ قَوْلُهُ:\nبانَتْ سُعادُ وأَمْسَى حَبْلُها انْقَطَعا\nوَتُسَمَّى أَلف الْفَاصِلَةِ، فَوَصَلَ أَلف الْعَيْنِ بِأَلِفٍ بَعْدَهَا؛ وَمِنْهُ قَوْلُهُ عَزَّ وَجَلَّ: وَتَظُنُّونَ بِاللَّهِ الظُّنُونَا؛ الأَلف الَّتِي بَعْدَ النُّونِ الأَخيرة هِيَ صِلَةٌ لِفَتْحَةِ النُّونِ، وَلَهَا أَخوات فِي فَوَاصِلِ الْآيَاتِ كَقوله عَزَّ وَجَلَّ: قَوارِيرَا* وسَلْسَبِيلًا؛ وأَما فَتْحَةُ هَا الْمُؤَنَّثِ فَقَوْلُكَ ضَرَبْتُهَا وَمَرَرْتُ بِهَا، وَالْفَرْقُ بَيْنَ أَلِفِ الْوَصْلِ وأَلف الصِّلَةِ أَن أَلف الْوَصْلِ إِنَّمَا اجْتُلِبَتْ فِي أَوائل الأَسماء والأَفعال، وَأَلِفَ الصِّلَةِ فِي أَواخر الأَسماء كَمَا تَرَى؛ وَمِنْهَا أَلف النُّونِ الْخَفِيفَةِ كَقَوْلِهِ عَزَّ وَجَلَّ: لَنَسْفَعاً بِالنَّاصِيَةِ، وَكَقَوْلِهِ عَزَّ وَجَلَّ: وَلَيَكُوناً مِنَ الصَّاغِرِينَ؛ الْوُقُوفُ عَلَى لَنَسْفَعاً وَعَلَى وَلَيَكُوناً بالأَلف، وَهَذِهِ الأَلف خَلَفٌ مِنَ النُّونِ، والنونُ الْخَفِيفَةُ أَصلها الثَّقِيلَةُ إِلَّا أَنها خُفّفت؛ مِنْ ذَلِكَ قَوْلُ الأَعشى:\nوَلَا تَحْمَدِ المُثْرِينَ وَاللَّهَ فَاحْمَدا\nأَراد فاحْمَدَنْ، بِالنُّونِ الْخَفِيفَةِ، فَوَقَفَ عَلَى الأَلف؛ وَقَالَ آخَرُ:\nوقُمَيْرٍ بَدَا ابْنَ خَمْسٍ وعِشْرِينَ، ... فَقَالَتْ لَهُ الفَتاتانِ: قُوما\nأَراد: قُومَنْ فَوَقَفَ بالأَلف؛ وَمِثْلُهُ قَوْلُهُ:\nيَحْسَبهُ الجاهِلُ مَا لَمْ يَعْلَما ... شَيْخاً، عَلَى كُرْسِيِّه، مُعَمَّمَا\nفَنَصَبَ يَعْلم لأَنه أَراد مَا لَمْ يَعْلَمن بِالنُّونِ الْخَفِيفَةِ فَوَقَفَ بالأَلف؛ وَقَالَ أَبو عِكْرِمَةَ الضَّبِّيُّ فِي قَوْلِ امْرِئِ الْقَيْسِ:\nقِفا نَبْكِ مِن ذِكْرَى حَبِيبٍ ومَنْزِلِ\nقَالَ: أَراد قِفَنْ فأَبدل الأَلف مِنَ النُّونِ الْخَفِيفَةِ كَقَوْلِهِ قُوما أَراد قُومَنْ. قَالَ أَبو بَكْرٍ: وَكَذَلِكَ قَوْلُهُ عَزَّ وَجَلَّ: أَلْقِيا فِي جَهَنَّمَ؛ أَكثر الرِّوَايَةِ أَن الْخِطَابَ لِمَالِكٍ خَازِنِ جَهَنَّمَ وَحْدَهُ فَبَنَاهُ عَلَى مَا وَصَفْنَاهُ، وَقِيلَ: هُوَ خِطَابٌ لِمَالِكٍ ومَلَكٍ مَعَهُ، وَاللَّهُ أَعلم؛ وَمِنْهَا أَلِفُ الْجَمْعِ مِثْلَ مَساجد وجِبال وفُرْسان وفَواعِل، وَمِنْهَا التَّفْضِيلُ وَالتَّصْغِيرُ كَقَوْلِهِ فُلَانٌ أَكْرَمُ منكَ وأَلأَمُ مِنْكَ وَفُلَانٌ أَجْهَلُ الناسِ، وَمِنْهَا أَلِفُ النِّداء كَقَوْلِكَ أَزَيْدُ؛ تُرِيدُ يَا زَيْدُ، وَمِنْهَا أَلف النُّدبة كقولك وا زَيْداه أَعني الأَلف الَّتِي بَعْدَ الدَّالِ، وَيُشَاكِلُهَا أَلف الِاسْتِنْكَارِ إِذَا قَالَ رَجُلٌ جَاءَ أَبو عَمْرٍو فيُجِيب الْمُجِيبُ أَبو عَمْراه، زِيدَتِ الْهَاءُ عَلَى الْمَدَّةِ فِي الِاسْتِنْكَارِ كما زيدت في وا فُلاناهْ فِي النُّدْبَةِ، وَمِنْهَا أَلِفُ التأْنيث نَحْوَ مدَّةٍ حَمْراء وبَيْضاء ونُفَساء، وَمِنْهَا أَلف سَكْرَى وحُبْلَى، وَمِنْهَا أَلف التَّعايِي وَهُوَ أَن يَقُولَ الرَّجُلُ إِنَّ عُمر، ثُمَّ يُرْتَجُ عَلَيْهِ كلامُه فَيَقِفُ عَلَى عُمر وَيَقُولُ إِنَّ عُمرا، فَيَمُدُّهَا مُسْتَمِدًّا لِمَا يُفتح لَهُ مِنَ الْكَلَامِ فَيَقُولُ مُنْطَلِق، الْمَعْنَى إنَّ عُمَرَ مُنْطَلِقٌ إِذَا لَمْ يَتعايَ، وَيَفْعَلُونَ ذَلِكَ فِي التَّرْخِيمِ كَمَا يَقُولُ يَا عُما وَهُوَ يُرِيدُ يَا عُمر، فَيَمُدُّ فَتْحَةَ الْمِيمِ بالأَلف لِيَمْتَدَّ الصَّوْتُ؛ وَمِنْهَا أَلِفَاتُ المدَّات كَقَوْلِ الْعَرَبِ لِلْكَلْكَلِ الكَلْكال، وَيَقُولُونَ للخاتَم خَاتَامُ، وللدانَق دَانَاقُ. قَالَ أَبو بَكْرٍ: الْعَرَبُ تَصِلُ الْفَتْحَةَ بالأَلف وَالضَّمَّةَ بِالْوَاوِ وَالْكَسْرَةَ بِالْيَاءِ؛ فمِن وَصْلِهم الْفَتْحَةَ بالأَلف قولُ الرَّاجِزِ:\nقُلْتُ وَقَدْ خَرَّتْ علَى الكَلْكَالِ: ... يَا ناقَتِي مَا جُلْتِ عَنْ مَجالِي\nأَراد: عَلَى الكَلْكَلِ فَوَصَل فَتْحَةَ الْكَافِ بالأَلف، وَقَالَ آخَرُ:\nلَها مَتْنَتانِ خَظاتا كَمَا\nأَرادَ: خَظَتا؛ ومِن وصلِهم الضمةَ بِالْوَاوِ مَا أَنشده الْفَرَّاءُ:\nلَوْ أَنَّ عَمْراً هَمَّ أَنْ يَرْقُودا، ... فانْهَضْ فَشُدَّ المِئزَرَ المَعْقُودا\nأَرَادَ: أَنْ يَرْقُدَ، فَوَصَلَ ضَمَّةَ الْقَافِ بِالْوَاوِ؛ وأَنشدَ أَيضاً:\nاللهُ يَعْلَمُ أَنَّا فِي تَلَفُّتِنا، ... يَومَ الفِراقِ، إِلَى إخْوانِنا صُورُ\n[[. قوله [إخواننا] تقدّم في صور: أحبابنا، وكذا هو في المحكم.]] وأَنَّنِي حَيْثُما يَثْني الهَوَى بَصَرِي، ... مِنْ حَيْثُما سَلَكُوا، أَدْنو فأَنْظُورُ\nأَراد: فأَنْظُرُ؛ وأَنشد فِي وَصْلِ الْكَسْرَةِ بِالْيَاءِ:\nلَا عَهْدَ لِي بِنِيضالِ، ... أَصْبحْتُ كالشَّنِّ البالِي\nأَراد: بِنِضال؛ وَقَالَ:\nعلَى عَجَلٍ مِنِّي أُطَأْطِئُ شِيمالِي\nأَراد: شِمالِي، فَوَصَلَ الْكَسْرَةَ بِالْيَاءِ؛ وَقَالَ عَنْتَرَةُ:\nيَنْباعُ مِنْ ذِفْرَى غَضُوبٍ جَسْرةٍ\nأَرَادَ: يَنْبَعُ؛ قَالَ: وَهَذَا قَوْلُ أَكثر أَهْلِ اللُّغَةِ، وَقَالَ بَعْضُهُمْ: يَنْباعُ يَنْفَعِل مِنْ باعَ يَبُوع، والأَول يَفْعَلُ مِن نَبَعَ يَنْبَعُ؛ وَمِنْهَا الأَلف المُحوَّلة، وَهِيَ كُلُّ أَلِفٍ أَصْلُهَا الْيَاءُ وَالْوَاوُ الْمُتَحَرِّكَتَانِ كَقَوْلِكَ قَالَ وباعَ وَقَضَى وغَزا وَمَا أَشْبَهَهَا؛ وَمِنْهَا أَلِفُ التَّثْنِيَةِ كَقَوْلِكَ يَجْلِسانِ ويَذْهَبانِ، وَمِنْهَا أَلِفُ التَّثْنِيَةِ فِي الأَسماء كَقَوْلِكَ الزَّيْدان والعَمْران. وَقَالَ أَبو زَيْدٍ: سَمِعْتُهُمْ يَقُولُونَ أَيا أَياه أَقبل، وَزْنُهُ عَيا عَياه. وَقَالَ أَبو بَكْرِ بْنُ الأَنباري: أَلف الْقَطْعِ فِي أَوائل الأَسماء عَلَى وَجْهَيْنِ: أَحدهما أَن تَكُونَ فِي أَوائل الأَسماء الْمُنْفَرِدَةِ، وَالْوَجْهُ الْآخَرُ أَن تَكُونَ فِي أَوائل الْجَمْعِ، فَالَّتِي فِي أَوائل الأَسماء تَعْرِفُهَا بِثَبَاتِهَا فِي التَّصْغِيرِ بأَن تَمْتَحِنَ الأَلف فَلَا تَجِدُهَا فَاءً وَلَا عَيْنًا وَلَا لَامًا، وَكَذَلِكَ فحَيُّوا بأَحسن مِنْهَا، وَالْفَرْقُ بَيْنَ أَلف الْقَطْعِ وَأَلِفِ الْوَصْلِ أَنَّ أَلف الْوَصْلِ فَاءٌ مِنَ الْفِعْلِ، وألف القطع لَيْسَتْ فَاءً وَلَا عَيْنًا وَلَا لَامًا، وأَما أَلِفُ الْقَطْعِ فِي الْجَمْعِ فَمِثْلُ أَلف أَلوان وَأَزْوَاجٍ، وَكَذَلِكَ أَلف الْجَمْعِ فِي السَّتَهِ، وأَما أَلفات الْوَصْلِ فِي أَوائل الأَسماء فَهِيَ تِسْعَةٌ: أَلف ابْنِ وَابْنَةَ وَابْنَيْنِ وَابْنَتَيْنِ وَامْرِئٍ وامرأَة وَاسْمٍ وَاسْتٍ فَهَذِهِ ثَمَانِيَةٌ تُكْسَرُ الأَلف فِي الِابْتِدَاءِ وَتُحْذَفُ فِي الْوَصْلِ، وَالتَّاسِعَةُ الأَلف الَّتِي تَدْخُلُ مَعَ اللَّامِ لِلتَّعْرِيفِ، وَهِيَ مَفْتُوحَةٌ فِي الِابْتِدَاءِ سَاقِطَةٌ فِي الْوَصْلِ كَقَوْلِكَ الرَّحْمَنُ، الْقَارِعَةُ، الحاقَّة، تَسْقُطُ هَذِهِ الأَلفات فِي الْوَصْلِ وَتَنْفَتِحُ فِي الِابْتِدَاءِ. التهذيب: وَتَقُولُ لِلرَّجُلِ إِذَا نَادَيْتَهُ: آفلان وأَ فلان وَآ يَا فُلَانُ، بِالْمَدِّ، والعرب تزيد آإذا أَرادوا الْوُقُوفَ عَلَى الْحَرْفِ الْمُنْفَرِدِ؛ أَنشد الْكِسَائِيُّ:\nدَعا فُلانٌ رَبَّه فَأَسْمَعا[[. قوله [دعا فلان إلخ] كذا بالأصل، وتقدم في معي: دعا كلانا.]] ... بالخَيْرِ خَيْراتٍ، وإِنْ شَرًّا فَآ،\nوَلَا أُرِيدُ الشَّرَّ إِلَّا أَنْ تَآ\nقَالَ: يُرِيدُ إِلَّا أَن تَشَاءَ، فَجَاءَ بِالتَّاءِ وَحْدَهَا وَزَادَ عَلَيْهَا آ، وَهِيَ فِي لُغَةِ بَنِي سَعْدٍ، إِلَّا أَن تَا بأَلف لَيِّنَةٍ وَيَقُولُونَ أَلا تَا، يَقُولُ: أَلا تَجِيء، فَيَقُولُ الْآخَرُ: بَلَى فَا أَي فَاذْهَبْ بِنَا، وَكَذَلِكَ قَوْلُهُ وَإِنْ شَرًّا فَآ، يُرِيدُ: إِنْ شَرًّا فَشَرٌّ. الجوهري: آحرف هِجَاءٍ مَقْصُورَةٌ مَوْقُوفَةٌ، فَإِنْ جَعَلْتَهَا اسْمًا مَدَدْتَهَا، وَهِيَ تُؤَنَّثُ مَا لَمْ تُسَمَّ حَرْفًا، فَإِذَا صُغِّرَتْ آيَةٌ قُلْتَ أُيَيَّة، وَذَلِكَ إِذَا كَانَتْ صَغِيرَةً فِي الْخَطِّ، وَكَذَلِكَ الْقَوْلُ فِيمَا أَشبهها مِنَ الْحُرُوفِ؛ قَالَ ابْنُ بَرِّيٍّ: صَوَابُ هَذَا الْقَوْلِ إِذَا صُغِّرَتْ آءَ فِيمَنْ أَنث قُلْتَ أُيية عَلَى قَوْلِ مَنْ يَقُولُ زَيَّيْتُ زَايًا وَذَيَّلْتُ ذَالًا، وأَما عَلَى قَوْلِ مَنْ يَقُولُ زَوَّيْتُ زَاياً فَإِنَّهُ يَقُولُ فِي تَصْغِيرِهَا أُوَيَّة، وَكَذَلِكَ تَقُولُ فِي الزَّايِ زُوَيَّة. قَالَ الْجَوْهَرِيُّ فِي آخِرِ تَرْجَمَةِ أَوا: آءَ حَرْفٌ يُمَدُّ وَيُقْصَرُ، فَإِذَا مَدَدْتَ نوَّنت، وَكَذَلِكَ سَائِرُ حُرُوفِ الْهِجَاءِ، والأَلف يُنَادَى بِهَا الْقَرِيبُ دُونَ الْبَعِيدِ، تَقُولُ: أَزَيْدُ أَقبِل، بأَلف مَقْصُورَةٍ والأَلف مِنْ حُرُوفِ الْمَدِّ وَاللِّينِ، فَاللَّيِّنَةُ تُسَمَّى الأَلف، وَالْمُتَحَرِّكَةُ تُسَمَّى الْهَمْزَةَ، وَقَدْ يَتَجَوَّزُ فِيهَا فَيُقَالُ أَيضاً أَلف، وَهُمَا جَمِيعًا مِنْ حُرُوفِ الزِّيادات، وَقَدْ تَكُونُ الأَلف ضَمِيرَ الِاثْنَيْنِ فِي الأَفعال نَحْوَ فَعَلا ويَفْعَلانِ، وعلامةَ التَّثْنِيَةِ فِي الأَسماء، ودَليلَ الرَّفْعِ نَحْوَ زَيْدَانِ ورجُلان، وَحُرُوفُ الزِّيَادَاتِ عَشَرَةٌ يَجْمَعُهَا قَوْلُكَ: [الْيَوْمَ تَنْساه] وَإِذَا تَحَرَّكَتْ فَهِيَ هَمْزَةٌ، وَقَدْ تُزَادُ فِي الْكَلَامِ لِلِاسْتِفْهَامِ، تَقُولُ: أَزَيْدٌ عِنْدَكَ أَم عَمْرو، فَإِنِ اجْتَمَعَتْ هَمْزَتَانِ فَصَلْتَ بَيْنَهُمَا بأَلف؛ قال ذو الرمة:\nأَبا ظَبْيةَ الوَعْساء بَيْنَ جُلاجِلٍ ... وبيْنَ النَّقا، آأَنْتِ أَمْ أُمُّ سالِمِ؟\nقَالَ: والأَلف عَلَى ضَرْبَيْنِ أَلف وَصْلٍ وأَلف قَطْعٍ، فَكُلُّ مَا ثَبَتَ فِي الْوَصْلِ، فَهُوَ أَلِفُ الْقَطْعِ، وَمَا لَمْ يَثْبُتْ فَهُوَ أَلِفُ الْوَصْلِ، وَلَا تَكُونُ إِلَّا زَائِدَةً، وَأَلِفُ الْقَطْعِ قَدْ تَكُونُ زَائِدَةً مِثْلَ أَلِفِ الِاسْتِفْهَامِ، وَقَدْ تَكُونُ أَصلية مِثْلَ أَخَذَ وأَمَرَ، وَاللَّهُ أَعلم."
  }
]